scripts/cassandra/output-5-5.txt
******************** Stress Settings ********************
Command:
  Type: mixed
  Count: -1
  Duration: 1 MINUTES
  No Warmup: false
  Consistency Level: LOCAL_ONE
  Target Uncertainty: not applicable
  Key Size (bytes): 10
  Counter Increment Distibution: add=fixed(1)
  Command Ratios: {WRITE=5.0, READ=5.0}
  Command Clustering Distribution: clustering=GAUSSIAN(1..10)
Rate:
  Auto: false
  Thread Count: 50
  OpsPer Sec: 0
Population:
  Distribution: Gaussian:  min=1,max=1000000,mean=500000.500000,stdev=166666.500000
  Order: ARBITRARY
  Wrap: false
Insert:
  Revisits: Uniform:  min=1,max=1000000
  Visits: Fixed:  key=1
  Row Population Ratio: Ratio: divisor=1.000000;delegate=Fixed:  key=1
  Batch Type: not batching
Columns:
  Max Columns Per Key: 5
  Column Names: [C0, C1, C2, C3, C4]
  Comparator: AsciiType
  Timestamp: null
  Variable Column Count: false
  Slice: false
  Size Distribution: Fixed:  key=34
  Count Distribution: Fixed:  key=5
Errors:
  Ignore: false
  Tries: 10
Log:
  No Summary: false
  No Settings: false
  File: null
  Interval Millis: 1000
  Level: NORMAL
Mode:
  API: JAVA_DRIVER_NATIVE
  Connection Style: CQL_PREPARED
  CQL Version: CQL3
  Protocol Version: V5
  Username: null
  Password: null
  Auth Provide Class: null
  Max Pending Per Connection: 128
  Connections Per Host: 8
  Compression: NONE
Node:
  Nodes: [localhost]
  Is White List: false
  Datacenter: null
Schema:
  Keyspace: keyspace1
  Replication Strategy: org.apache.cassandra.locator.SimpleStrategy
  Replication Strategy Options: {replication_factor=1}
  Table Compression: null
  Table Compaction Strategy: null
  Table Compaction Strategy Options: {}
Transport:
  truststore=null; truststore-password=null; keystore=null; keystore-password=null; ssl-protocol=TLS; ssl-alg=null; ssl-ciphers=TLS_RSA_WITH_AES_128_CBC_SHA,TLS_RSA_WITH_AES_256_CBC_SHA; 
Port:
  Native Port: 9042
  JMX Port: 7199
Send To Daemon:
  *not set*
Graph:
  File: null
  Revision: unknown
  Title: null
  Operation: MIXED
TokenRange:
  Wrap: false
  Split Factor: 1

Sleeping 2s...
Warming up WRITE with 50000 iterations...
Connected to cluster: my_cluster, max pending requests per connection 128, max connections per host 8
Datacenter: dc1; Host: localhost/127.0.0.1:9042; Rack: rack1
Datacenter: dc1; Host: /192.168.176.3:9042; Rack: rack1
Failed to connect over JMX; not collecting these stats
Warming up READ with 50000 iterations...
Failed to connect over JMX; not collecting these stats
Running [WRITE, READ] with 50 threads 1 minutes
Failed to connect over JMX; not collecting these stats
type                                               total ops,    op/s,    pk/s,   row/s,    mean,     med,     .95,     .99,    .999,     max,   time,   stderr, errors,  gc: #,  max ms,  sum ms,  sdv ms,      mb
READ,                                                    298,     298,     298,     298,     7.3,     7.1,    11.8,    14.8,    16.0,    16.0,    1.0,  0.00000,      0,      0,       0,       0,       0,       0
WRITE,                                                   289,     289,     289,     289,     7.8,     7.6,    13.1,    14.8,    15.7,    15.7,    1.0,  0.00000,      0,      0,       0,       0,       0,       0
total,                                                   587,     587,     587,     587,     7.5,     7.3,    12.7,    14.8,    15.7,    16.0,    1.0,  0.00000,      0,      0,       0,       0,       0,       0
READ,                                                   3573,    3275,    3275,    3275,     7.1,     6.6,    10.4,    18.9,    63.6,    71.0,    2.0,  0.60332,      0,      0,       0,       0,       0,       0
WRITE,                                                  4011,    3722,    3722,    3722,     7.2,     6.8,    10.4,    21.8,    61.2,    64.4,    2.0,  0.60332,      0,      0,       0,       0,       0,       0
total,                                                  7584,    6997,    6997,    6997,     7.1,     6.7,    10.4,    21.8,    62.1,    71.0,    2.0,  0.60332,      0,      0,       0,       0,       0,       0
READ,                                                   6888,    3315,    3315,    3315,     7.4,     6.7,    11.0,    31.2,    67.3,    72.9,    3.0,  0.36086,      0,      0,       0,       0,       0,       0
WRITE,                                                  7297,    3286,    3286,    3286,     7.8,     7.1,    11.3,    34.7,    70.0,    75.9,    3.0,  0.36086,      0,      0,       0,       0,       0,       0
total,                                                 14185,    6601,    6601,    6601,     7.6,     6.9,    11.2,    32.3,    68.7,    75.9,    3.0,  0.36086,      0,      0,       0,       0,       0,       0
READ,                                                  10387,    3499,    3499,    3499,     7.1,     6.7,    10.6,    22.9,    33.9,    34.4,    4.0,  0.25842,      0,      0,       0,       0,       0,       0
WRITE,                                                 10764,    3467,    3467,    3467,     7.3,     7.0,    10.7,    21.4,    33.2,    42.5,    4.0,  0.25842,      0,      0,       0,       0,       0,       0
total,                                                 21151,    6966,    6966,    6966,     7.2,     6.9,    10.6,    21.9,    33.2,    42.5,    4.0,  0.25842,      0,      0,       0,       0,       0,       0
READ,                                                  13837,    3450,    3450,    3450,     6.8,     6.6,    10.5,    18.6,    31.8,    32.9,    5.0,  0.20168,      0,      0,       0,       0,       0,       0
WRITE,                                                 14546,    3782,    3782,    3782,     7.0,     6.8,    10.4,    17.0,    31.3,    34.3,    5.0,  0.20168,      0,      0,       0,       0,       0,       0
total,                                                 28383,    7232,    7232,    7232,     6.9,     6.7,    10.5,    17.4,    31.8,    34.3,    5.0,  0.20168,      0,      0,       0,       0,       0,       0
READ,                                                  17318,    3481,    3481,    3481,     7.1,     6.8,    10.7,    19.0,    37.8,    40.2,    6.0,  0.16529,      0,      0,       0,       0,       0,       0
WRITE,                                                 17941,    3395,    3395,    3395,     7.4,     7.1,    10.9,    26.4,    39.8,    42.0,    6.0,  0.16529,      0,      0,       0,       0,       0,       0
total,                                                 35259,    6876,    6876,    6876,     7.2,     7.0,    10.9,    22.1,    38.0,    42.0,    6.0,  0.16529,      0,      0,       0,       0,       0,       0
READ,                                                  20414,    3096,    3096,    3096,     7.7,     7.5,    11.8,    21.4,    34.8,    39.9,    7.0,  0.14059,      0,      0,       0,       0,       0,       0
WRITE,                                                 21206,    3265,    3265,    3265,     8.0,     7.8,    11.8,    23.1,    35.9,    37.7,    7.0,  0.14059,      0,      0,       0,       0,       0,       0
total,                                                 41620,    6361,    6361,    6361,     7.9,     7.6,    11.8,    22.1,    35.9,    39.9,    7.0,  0.14059,      0,      0,       0,       0,       0,       0
READ,                                                  23935,    3521,    3521,    3521,     7.2,     6.8,    10.8,    26.1,    34.7,    40.2,    8.0,  0.12197,      0,      0,       0,       0,       0,       0
WRITE,                                                 24567,    3361,    3361,    3361,     7.3,     7.1,    10.9,    23.4,    35.5,    37.7,    8.0,  0.12197,      0,      0,       0,       0,       0,       0
total,                                                 48502,    6882,    6882,    6882,     7.2,     7.0,    10.9,    24.9,    35.5,    40.2,    8.0,  0.12197,      0,      0,       0,       0,       0,       0
READ,                                                  27635,    3700,    3700,    3700,     7.0,     6.7,    10.4,    23.6,    33.7,    38.3,    9.0,  0.10775,      0,      0,       0,       0,       0,       0
WRITE,                                                 27901,    3334,    3334,    3334,     7.2,     7.1,    10.7,    22.5,    35.8,    38.8,    9.0,  0.10775,      0,      0,       0,       0,       0,       0
total,                                                 55536,    7034,    7034,    7034,     7.1,     6.9,    10.5,    22.9,    35.3,    38.8,    9.0,  0.10775,      0,      0,       0,       0,       0,       0
READ,                                                  31125,    3490,    3490,    3490,     7.1,     6.9,    11.0,    14.2,    29.2,    33.3,   10.0,  0.09647,      0,      0,       0,       0,       0,       0
WRITE,                                                 31317,    3416,    3416,    3416,     7.3,     7.3,    11.0,    15.1,    31.8,    33.9,   10.0,  0.09647,      0,      0,       0,       0,       0,       0
total,                                                 62442,    6906,    6906,    6906,     7.2,     7.1,    11.0,    14.9,    29.5,    33.9,   10.0,  0.09647,      0,      0,       0,       0,       0,       0
READ,                                                  34703,    3578,    3578,    3578,     6.5,     6.5,     9.8,    11.3,    24.1,    32.5,   11.0,  0.08762,      0,      0,       0,       0,       0,       0
WRITE,                                                 35192,    3875,    3875,    3875,     6.7,     6.7,    10.0,    11.9,    26.3,    29.1,   11.0,  0.08762,      0,      0,       0,       0,       0,       0
total,                                                 69895,    7453,    7453,    7453,     6.6,     6.6,     9.9,    11.7,    25.8,    32.5,   11.0,  0.08762,      0,      0,       0,       0,       0,       0
READ,                                                  38204,    3501,    3501,    3501,     7.3,     6.9,    11.7,    21.1,    40.3,    47.6,   12.0,  0.08004,      0,      0,       0,       0,       0,       0
WRITE,                                                 38473,    3281,    3281,    3281,     7.6,     7.2,    11.9,    23.3,    42.1,    50.8,   12.0,  0.08004,      0,      0,       0,       0,       0,       0
total,                                                 76677,    6782,    6782,    6782,     7.4,     7.1,    11.8,    22.4,    41.4,    50.8,   12.0,  0.08004,      0,      0,       0,       0,       0,       0
READ,                                                  41557,    3353,    3353,    3353,     7.5,     6.9,    11.4,    28.9,    58.3,    70.7,   13.0,  0.07369,      0,      0,       0,       0,       0,       0
WRITE,                                                 41645,    3172,    3172,    3172,     7.9,     7.3,    11.9,    32.4,    59.8,    75.2,   13.0,  0.07369,      0,      0,       0,       0,       0,       0
total,                                                 83202,    6525,    6525,    6525,     7.7,     7.1,    11.7,    31.1,    59.5,    75.2,   13.0,  0.07369,      0,      0,       0,       0,       0,       0
READ,                                                  44964,    3407,    3407,    3407,     6.9,     6.5,    10.0,    19.8,    57.4,    62.3,   14.0,  0.06841,      0,      0,       0,       0,       0,       0
WRITE,                                                 45414,    3769,    3769,    3769,     7.0,     6.7,    10.2,    25.9,    58.3,    59.0,   14.0,  0.06841,      0,      0,       0,       0,       0,       0
total,                                                 90378,    7176,    7176,    7176,     6.9,     6.6,    10.1,    24.3,    58.3,    62.3,   14.0,  0.06841,      0,      0,       0,       0,       0,       0
READ,                                                  48595,    3631,    3631,    3631,     6.5,     6.2,     9.8,    15.3,    28.1,    36.5,   15.0,  0.06402,      0,      0,       0,       0,       0,       0
WRITE,                                                 49381,    3967,    3967,    3967,     6.7,     6.6,     9.9,    14.7,    33.6,    38.4,   15.0,  0.06402,      0,      0,       0,       0,       0,       0
total,                                                 97976,    7598,    7598,    7598,     6.6,     6.4,     9.9,    15.3,    31.7,    38.4,   15.0,  0.06402,      0,      0,       0,       0,       0,       0
READ,                                                  52020,    3425,    3425,    3425,     7.2,     6.9,    11.2,    15.1,    36.8,    38.2,   16.0,  0.05992,      0,      0,       0,       0,       0,       0
WRITE,                                                 52792,    3411,    3411,    3411,     7.4,     7.2,    11.5,    17.0,    36.4,    37.4,   16.0,  0.05992,      0,      0,       0,       0,       0,       0
total,                                                104812,    6836,    6836,    6836,     7.3,     7.1,    11.3,    16.6,    36.5,    38.2,   16.0,  0.05992,      0,      0,       0,       0,       0,       0
READ,                                                  55472,    3452,    3452,    3452,     7.0,     6.6,    10.6,    15.2,    40.3,    49.2,   17.0,  0.05631,      0,      0,       0,       0,       0,       0
WRITE,                                                 56348,    3556,    3556,    3556,     7.3,     7.1,    11.0,    19.2,    42.0,    49.7,   17.0,  0.05631,      0,      0,       0,       0,       0,       0
total,                                                111820,    7008,    7008,    7008,     7.1,     6.9,    10.8,    16.6,    40.9,    49.7,   17.0,  0.05631,      0,      0,       0,       0,       0,       0
READ,                                                  58946,    3474,    3474,    3474,     7.0,     6.8,    10.4,    18.6,    36.8,    42.1,   18.0,  0.05310,      0,      0,       0,       0,       0,       0
WRITE,                                                 59826,    3478,    3478,    3478,     7.3,     7.2,    10.7,    19.3,    37.3,    40.5,   18.0,  0.05310,      0,      0,       0,       0,       0,       0
total,                                                118772,    6952,    6952,    6952,     7.2,     7.0,    10.6,    19.2,    37.1,    42.1,   18.0,  0.05310,      0,      0,       0,       0,       0,       0
READ,                                                  62580,    3634,    3634,    3634,     6.8,     6.7,    10.2,    15.8,    34.7,    37.8,   19.0,  0.05028,      0,      0,       0,       0,       0,       0
WRITE,                                                 63374,    3548,    3548,    3548,     7.1,     6.9,    10.4,    14.3,    35.6,    48.0,   19.0,  0.05028,      0,      0,       0,       0,       0,       0
total,                                                125954,    7182,    7182,    7182,     7.0,     6.8,    10.3,    14.9,    35.2,    48.0,   19.0,  0.05028,      0,      0,       0,       0,       0,       0
READ,                                                  64989,    2409,    2409,    2409,    10.1,     6.5,    10.7,   303.3,   316.4,   336.3,   20.0,  0.04776,      0,      0,       0,       0,       0,       0
WRITE,                                                 65988,    2614,    2614,    2614,     9.8,     6.8,    10.9,    32.3,   321.9,   340.8,   20.0,  0.04776,      0,      0,       0,       0,       0,       0
total,                                                130977,    5023,    5023,    5023,     9.9,     6.6,    10.7,    37.7,   321.9,   340.8,   20.0,  0.04776,      0,      0,       0,       0,       0,       0
READ,                                                  67931,    2942,    2942,    2942,     7.8,     6.6,    10.4,    29.9,   155.2,   172.0,   21.0,  0.04545,      0,      0,       0,       0,       0,       0
WRITE,                                                 69242,    3254,    3254,    3254,     8.2,     6.8,    10.6,    34.4,   155.8,   169.2,   21.0,  0.04545,      0,      0,       0,       0,       0,       0
total,                                                137173,    6196,    6196,    6196,     8.1,     6.7,    10.4,    33.0,   155.8,   172.0,   21.0,  0.04545,      0,      0,       0,       0,       0,       0
READ,                                                  71439,    3508,    3508,    3508,     7.0,     6.7,    10.8,    19.2,    36.9,    43.9,   22.0,  0.04334,      0,      0,       0,       0,       0,       0
WRITE,                                                 72701,    3459,    3459,    3459,     7.3,     7.1,    11.0,    19.9,    39.4,    40.2,   22.0,  0.04334,      0,      0,       0,       0,       0,       0
total,                                                144140,    6967,    6967,    6967,     7.2,     6.9,    10.9,    19.7,    38.0,    43.9,   22.0,  0.04334,      0,      0,       0,       0,       0,       0
READ,                                                  74819,    3380,    3380,    3380,     7.1,     6.6,    10.5,    25.0,    64.1,    69.0,   23.0,  0.04143,      0,      0,       0,       0,       0,       0
WRITE,                                                 76251,    3550,    3550,    3550,     7.3,     6.9,    10.5,    24.0,    64.3,    70.3,   23.0,  0.04143,      0,      0,       0,       0,       0,       0
total,                                                151070,    6930,    6930,    6930,     7.2,     6.8,    10.5,    24.2,    64.3,    70.3,   23.0,  0.04143,      0,      0,       0,       0,       0,       0
READ,                                                  78414,    3595,    3595,    3595,     6.8,     6.6,    10.4,    13.9,    31.5,    45.9,   24.0,  0.03969,      0,      0,       0,       0,       0,       0
WRITE,                                                 79847,    3596,    3596,    3596,     7.1,     6.9,    10.6,    19.8,    30.5,    35.6,   24.0,  0.03969,      0,      0,       0,       0,       0,       0
total,                                                158261,    7191,    7191,    7191,     6.9,     6.8,    10.5,    18.1,    32.1,    45.9,   24.0,  0.03969,      0,      0,       0,       0,       0,       0
READ,                                                  81883,    3469,    3469,    3469,     6.9,     6.6,    10.3,    15.4,    55.6,    62.6,   25.0,  0.03810,      0,      0,       0,       0,       0,       0
WRITE,                                                 83490,    3643,    3643,    3643,     7.1,     6.9,    10.3,    19.1,    55.0,    66.6,   25.0,  0.03810,      0,      0,       0,       0,       0,       0
total,                                                165373,    7112,    7112,    7112,     7.0,     6.7,    10.3,    17.1,    55.6,    66.6,   25.0,  0.03810,      0,      0,       0,       0,       0,       0
READ,                                                  85477,    3594,    3594,    3594,     6.8,     6.6,    10.5,    16.4,    31.2,    33.6,   26.0,  0.03662,      0,      0,       0,       0,       0,       0
WRITE,                                                 87118,    3628,    3628,    3628,     7.0,     6.9,    10.6,    15.7,    32.7,    36.4,   26.0,  0.03662,      0,      0,       0,       0,       0,       0
total,                                                172595,    7222,    7222,    7222,     6.9,     6.7,    10.5,    16.1,    32.7,    36.4,   26.0,  0.03662,      0,      0,       0,       0,       0,       0
READ,                                                  88794,    3317,    3317,    3317,     7.2,     7.0,    11.0,    20.0,    40.2,    44.1,   27.0,  0.03527,      0,      0,       0,       0,       0,       0
WRITE,                                                 90531,    3413,    3413,    3413,     7.6,     7.4,    11.1,    28.7,    41.3,    46.3,   27.0,  0.03527,      0,      0,       0,       0,       0,       0
total,                                                179325,    6730,    6730,    6730,     7.4,     7.2,    11.0,    26.6,    41.0,    46.3,   27.0,  0.03527,      0,      0,       0,       0,       0,       0
READ,                                                  92400,    3606,    3606,    3606,     6.7,     6.5,    10.1,    18.0,    31.6,    33.4,   28.0,  0.03402,      0,      0,       0,       0,       0,       0
WRITE,                                                 94252,    3721,    3721,    3721,     6.9,     6.8,    10.3,    18.9,    30.8,    35.6,   28.0,  0.03402,      0,      0,       0,       0,       0,       0
total,                                                186652,    7327,    7327,    7327,     6.8,     6.6,    10.2,    18.3,    31.6,    35.6,   28.0,  0.03402,      0,      0,       0,       0,       0,       0
READ,                                                  95955,    3555,    3555,    3555,     6.7,     6.4,    10.2,    17.6,    30.7,    39.2,   29.0,  0.03286,      0,      0,       0,       0,       0,       0
WRITE,                                                 98060,    3808,    3808,    3808,     6.8,     6.7,    10.2,    13.8,    34.1,    38.8,   29.0,  0.03286,      0,      0,       0,       0,       0,       0
total,                                                194015,    7363,    7363,    7363,     6.8,     6.6,    10.2,    16.3,    34.1,    39.2,   29.0,  0.03286,      0,      0,       0,       0,       0,       0
READ,                                                  99747,    3792,    3792,    3792,     6.7,     6.4,    10.0,    19.0,    38.3,    42.0,   30.0,  0.03177,      0,      0,       0,       0,       0,       0
WRITE,                                                101577,    3517,    3517,    3517,     6.9,     6.7,    10.3,    24.5,    38.7,    43.5,   30.0,  0.03177,      0,      0,       0,       0,       0,       0
total,                                                201324,    7309,    7309,    7309,     6.8,     6.5,    10.1,    22.4,    39.5,    43.5,   30.0,  0.03177,      0,      0,       0,       0,       0,       0
READ,                                                 103387,    3640,    3640,    3640,     6.6,     6.4,    10.2,    14.4,    30.7,    39.1,   31.0,  0.03077,      0,      0,       0,       0,       0,       0
WRITE,                                                105326,    3749,    3749,    3749,     6.9,     6.7,    10.4,    13.6,    30.3,    36.8,   31.0,  0.03077,      0,      0,       0,       0,       0,       0
total,                                                208713,    7389,    7389,    7389,     6.8,     6.6,    10.3,    13.8,    30.7,    39.1,   31.0,  0.03077,      0,      0,       0,       0,       0,       0
READ,                                                 106954,    3567,    3567,    3567,     7.2,     6.6,    10.4,    25.0,    67.9,    73.5,   32.0,  0.02979,      0,      0,       0,       0,       0,       0
WRITE,                                                108541,    3215,    3215,    3215,     7.5,     7.1,    10.7,    26.4,    68.6,    69.5,   32.0,  0.02979,      0,      0,       0,       0,       0,       0
total,                                                215495,    6782,    6782,    6782,     7.4,     6.9,    10.6,    26.4,    68.6,    73.5,   32.0,  0.02979,      0,      0,       0,       0,       0,       0
READ,                                                 110584,    3630,    3630,    3630,     6.9,     6.7,    10.3,    13.8,    37.4,    44.4,   33.0,  0.02888,      0,      0,       0,       0,       0,       0
WRITE,                                                112067,    3526,    3526,    3526,     7.1,     7.1,    10.5,    17.4,    38.3,    40.8,   33.0,  0.02888,      0,      0,       0,       0,       0,       0
total,                                                222651,    7156,    7156,    7156,     7.0,     6.9,    10.4,    15.9,    38.3,    44.4,   33.0,  0.02888,      0,      0,       0,       0,       0,       0
READ,                                                 114340,    3756,    3756,    3756,     6.6,     6.4,    10.0,    15.7,    35.0,    42.8,   34.0,  0.02805,      0,      0,       0,       0,       0,       0
WRITE,                                                115712,    3645,    3645,    3645,     6.8,     6.7,    10.1,    18.3,    33.3,    35.9,   34.0,  0.02805,      0,      0,       0,       0,       0,       0
total,                                                230052,    7401,    7401,    7401,     6.7,     6.5,    10.1,    16.9,    34.3,    42.8,   34.0,  0.02805,      0,      0,       0,       0,       0,       0
READ,                                                 118228,    3888,    3888,    3888,     6.7,     6.4,    10.1,    15.0,    37.1,    39.1,   35.0,  0.02726,      0,      0,       0,       0,       0,       0
WRITE,                                                119131,    3419,    3419,    3419,     7.0,     6.9,    10.3,    16.7,    38.7,    40.5,   35.0,  0.02726,      0,      0,       0,       0,       0,       0
total,                                                237359,    7307,    7307,    7307,     6.8,     6.6,    10.2,    15.5,    38.0,    40.5,   35.0,  0.02726,      0,      0,       0,       0,       0,       0
READ,                                                 121604,    3376,    3376,    3376,     7.1,     6.6,    10.4,    20.3,    74.1,    80.0,   36.0,  0.02650,      0,      0,       0,       0,       0,       0
WRITE,                                                122681,    3550,    3550,    3550,     7.3,     6.8,    10.4,    24.8,    80.9,    84.8,   36.0,  0.02650,      0,      0,       0,       0,       0,       0
total,                                                244285,    6926,    6926,    6926,     7.2,     6.7,    10.4,    22.7,    77.1,    84.8,   36.0,  0.02650,      0,      0,       0,       0,       0,       0
READ,                                                 124905,    3301,    3301,    3301,     6.7,     6.5,    10.3,    13.3,    27.6,    37.7,   37.0,  0.02578,      0,      0,       0,       0,       0,       0
WRITE,                                                126304,    3623,    3623,    3623,     7.0,     6.9,    10.6,    15.7,    24.3,    30.0,   37.0,  0.02578,      0,      0,       0,       0,       0,       0
total,                                                251209,    6924,    6924,    6924,     6.8,     6.7,    10.5,    14.5,    26.1,    37.7,   37.0,  0.02578,      0,      0,       0,       0,       0,       0
READ,                                                 127854,    2949,    2949,    2949,     8.4,     6.4,    10.3,    30.1,   260.3,   261.1,   38.0,  0.02514,      0,      0,       0,       0,       0,       0
WRITE,                                                129116,    2812,    2812,    2812,     9.8,     6.9,    10.7,   255.9,   260.7,   262.8,   38.0,  0.02514,      0,      0,       0,       0,       0,       0
total,                                                256970,    5761,    5761,    5761,     9.1,     6.6,    10.5,    32.2,   260.6,   262.8,   38.0,  0.02514,      0,      0,       0,       0,       0,       0
READ,                                                 131551,    3697,    3697,    3697,     6.7,     6.5,    10.3,    16.7,    28.7,    43.7,   39.0,  0.02451,      0,      0,       0,       0,       0,       0
WRITE,                                                132759,    3643,    3643,    3643,     6.9,     6.8,    10.3,    12.9,    26.3,    34.7,   39.0,  0.02451,      0,      0,       0,       0,       0,       0
total,                                                264310,    7340,    7340,    7340,     6.8,     6.7,    10.3,    14.6,    28.7,    43.7,   39.0,  0.02451,      0,      0,       0,       0,       0,       0
READ,                                                 135049,    3498,    3498,    3498,     6.8,     6.6,    10.2,    14.9,    29.9,    32.5,   40.0,  0.02389,      0,      0,       0,       0,       0,       0
WRITE,                                                136430,    3671,    3671,    3671,     7.1,     6.9,    10.5,    22.8,    32.8,    51.3,   40.0,  0.02389,      0,      0,       0,       0,       0,       0
total,                                                271479,    7169,    7169,    7169,     7.0,     6.7,    10.3,    20.9,    32.5,    51.3,   40.0,  0.02389,      0,      0,       0,       0,       0,       0
READ,                                                 138505,    3456,    3456,    3456,     6.9,     6.3,    10.0,    28.6,    66.0,    69.9,   41.0,  0.02331,      0,      0,       0,       0,       0,       0
WRITE,                                                140023,    3593,    3593,    3593,     7.2,     6.6,    10.1,    30.6,    64.2,    66.1,   41.0,  0.02331,      0,      0,       0,       0,       0,       0
total,                                                278528,    7049,    7049,    7049,     7.1,     6.5,    10.0,    29.8,    65.0,    69.9,   41.0,  0.02331,      0,      0,       0,       0,       0,       0
READ,                                                 142184,    3679,    3679,    3679,     6.7,     6.4,    10.1,    18.6,    32.8,    37.4,   42.0,  0.02275,      0,      0,       0,       0,       0,       0
WRITE,                                                143647,    3624,    3624,    3624,     7.0,     6.8,    10.2,    18.2,    31.9,    36.9,   42.0,  0.02275,      0,      0,       0,       0,       0,       0
total,                                                285831,    7303,    7303,    7303,     6.8,     6.7,    10.1,    18.4,    32.4,    37.4,   42.0,  0.02275,      0,      0,       0,       0,       0,       0
READ,                                                 145803,    3619,    3619,    3619,     6.8,     6.6,    10.2,    16.5,    27.9,    43.7,   43.0,  0.02223,      0,      0,       0,       0,       0,       0
WRITE,                                                147350,    3703,    3703,    3703,     6.8,     6.8,    10.1,    15.3,    25.3,    28.4,   43.0,  0.02223,      0,      0,       0,       0,       0,       0
total,                                                293153,    7322,    7322,    7322,     6.8,     6.7,    10.2,    16.3,    26.1,    43.7,   43.0,  0.02223,      0,      0,       0,       0,       0,       0
READ,                                                 149488,    3685,    3685,    3685,     6.6,     6.5,     9.8,    12.1,    31.9,    38.5,   44.0,  0.02174,      0,      0,       0,       0,       0,       0
WRITE,                                                151081,    3731,    3731,    3731,     6.7,     6.6,    10.0,    11.8,    32.6,    44.9,   44.0,  0.02174,      0,      0,       0,       0,       0,       0
total,                                                300569,    7416,    7416,    7416,     6.7,     6.5,     9.9,    11.9,    32.6,    44.9,   44.0,  0.02174,      0,      0,       0,       0,       0,       0
READ,                                                 153320,    3832,    3832,    3832,     6.6,     6.3,     9.8,    19.8,    39.5,    43.6,   45.0,  0.02128,      0,      0,       0,       0,       0,       0
WRITE,                                                154699,    3618,    3618,    3618,     6.8,     6.7,    10.0,    12.7,    34.7,    40.3,   45.0,  0.02128,      0,      0,       0,       0,       0,       0
total,                                                308019,    7450,    7450,    7450,     6.7,     6.5,     9.9,    17.2,    38.8,    43.6,   45.0,  0.02128,      0,      0,       0,       0,       0,       0
READ,                                                 156943,    3623,    3623,    3623,     6.8,     6.5,    10.1,    19.3,    38.5,    42.6,   46.0,  0.02082,      0,      0,       0,       0,       0,       0
WRITE,                                                158373,    3674,    3674,    3674,     7.0,     6.8,    10.4,    20.3,    35.2,    43.8,   46.0,  0.02082,      0,      0,       0,       0,       0,       0
total,                                                315316,    7297,    7297,    7297,     6.9,     6.6,    10.3,    20.0,    38.3,    43.8,   46.0,  0.02082,      0,      0,       0,       0,       0,       0
READ,                                                 160210,    3267,    3267,    3267,     7.3,     6.8,    10.5,    30.4,    71.2,    78.6,   47.0,  0.02037,      0,      0,       0,       0,       0,       0
WRITE,                                                161885,    3512,    3512,    3512,     7.4,     6.9,    10.6,    32.2,    66.8,    71.0,   47.0,  0.02037,      0,      0,       0,       0,       0,       0
total,                                                322095,    6779,    6779,    6779,     7.4,     6.8,    10.5,    32.2,    70.0,    78.6,   47.0,  0.02037,      0,      0,       0,       0,       0,       0
READ,                                                 163816,    3606,    3606,    3606,     6.9,     6.7,    10.3,    24.0,    35.4,    40.8,   48.0,  0.01994,      0,      0,       0,       0,       0,       0
WRITE,                                                165382,    3497,    3497,    3497,     7.1,     7.0,    10.5,    22.0,    37.6,    44.2,   48.0,  0.01994,      0,      0,       0,       0,       0,       0
total,                                                329198,    7103,    7103,    7103,     7.0,     6.8,    10.4,    23.2,    37.1,    44.2,   48.0,  0.01994,      0,      0,       0,       0,       0,       0
READ,                                                 167432,    3616,    3616,    3616,     6.9,     6.6,    10.2,    19.5,    39.4,    42.3,   49.0,  0.01953,      0,      0,       0,       0,       0,       0
WRITE,                                                168899,    3517,    3517,    3517,     7.1,     7.1,    10.5,    16.1,    31.1,    44.5,   49.0,  0.01953,      0,      0,       0,       0,       0,       0
total,                                                336331,    7133,    7133,    7133,     7.0,     6.8,    10.4,    18.6,    38.8,    44.5,   49.0,  0.01953,      0,      0,       0,       0,       0,       0
READ,                                                 171111,    3679,    3679,    3679,     6.7,     6.4,    10.2,    17.8,    30.2,    33.9,   50.0,  0.01914,      0,      0,       0,       0,       0,       0
WRITE,                                                172556,    3657,    3657,    3657,     6.9,     6.7,    10.2,    16.2,    31.5,    38.3,   50.0,  0.01914,      0,      0,       0,       0,       0,       0
total,                                                343667,    7336,    7336,    7336,     6.8,     6.6,    10.2,    16.8,    31.5,    38.3,   50.0,  0.01914,      0,      0,       0,       0,       0,       0
READ,                                                 174583,    3472,    3472,    3472,     7.1,     6.4,    10.3,    30.6,    74.1,    77.7,   51.0,  0.01877,      0,      0,       0,       0,       0,       0
WRITE,                                                176018,    3462,    3462,    3462,     7.3,     6.7,    10.5,    34.0,    78.4,    79.6,   51.0,  0.01877,      0,      0,       0,       0,       0,       0
total,                                                350601,    6934,    6934,    6934,     7.2,     6.5,    10.4,    32.0,    77.7,    79.6,   51.0,  0.01877,      0,      0,       0,       0,       0,       0
READ,                                                 177985,    3402,    3402,    3402,     7.0,     6.6,    10.4,    22.4,    38.9,    45.6,   52.0,  0.01840,      0,      0,       0,       0,       0,       0
WRITE,                                                179746,    3728,    3728,    3728,     7.0,     6.8,    10.5,    24.1,    40.9,    42.2,   52.0,  0.01840,      0,      0,       0,       0,       0,       0
total,                                                357731,    7130,    7130,    7130,     7.0,     6.7,    10.4,    24.0,    40.6,    45.6,   52.0,  0.01840,      0,      0,       0,       0,       0,       0
READ,                                                 181247,    3262,    3262,    3262,     7.6,     7.1,    12.0,    25.1,    42.1,    49.0,   53.0,  0.01812,      0,      0,       0,       0,       0,       0
WRITE,                                                183014,    3268,    3268,    3268,     7.7,     7.5,    11.9,    18.3,    40.9,    48.9,   53.0,  0.01812,      0,      0,       0,       0,       0,       0
total,                                                364261,    6530,    6530,    6530,     7.6,     7.3,    12.0,    23.0,    41.8,    49.0,   53.0,  0.01812,      0,      0,       0,       0,       0,       0
READ,                                                 184153,    2906,    2906,    2906,     8.1,     7.6,    12.8,    29.2,    40.5,    44.6,   54.0,  0.01797,      0,      0,       0,       0,       0,       0
WRITE,                                                186235,    3221,    3221,    3221,     8.2,     7.9,    12.9,    21.3,    40.4,    42.8,   54.0,  0.01797,      0,      0,       0,       0,       0,       0
total,                                                370388,    6127,    6127,    6127,     8.1,     7.7,    12.8,    24.9,    40.5,    44.6,   54.0,  0.01797,      0,      0,       0,       0,       0,       0
READ,                                                 186202,    2049,    2049,    2049,    12.4,     7.5,    12.1,   372.5,   395.1,   397.7,   55.0,  0.01770,      0,      0,       0,       0,       0,       0
WRITE,                                                188299,    2064,    2064,    2064,    11.9,     7.8,    12.1,   371.5,   395.8,   396.1,   55.0,  0.01770,      0,      0,       0,       0,       0,       0
total,                                                374501,    4113,    4113,    4113,    12.2,     7.6,    12.1,   372.0,   395.6,   397.7,   55.0,  0.01770,      0,      0,       0,       0,       0,       0
READ,                                                 189351,    3149,    3149,    3149,     7.9,     7.1,    11.7,    26.0,    87.2,    87.8,   56.0,  0.01746,      0,      0,       0,       0,       0,       0
WRITE,                                                191270,    2971,    2971,    2971,     8.4,     7.6,    12.0,    29.0,    87.6,    89.8,   56.0,  0.01746,      0,      0,       0,       0,       0,       0
total,                                                380621,    6120,    6120,    6120,     8.1,     7.4,    11.8,    28.7,    87.3,    89.8,   56.0,  0.01746,      0,      0,       0,       0,       0,       0
READ,                                                 192552,    3201,    3201,    3201,     7.5,     7.3,    12.0,    14.5,    26.3,    31.1,   57.0,  0.01723,      0,      0,       0,       0,       0,       0
WRITE,                                                194621,    3351,    3351,    3351,     7.7,     7.6,    12.1,    14.9,    26.6,    28.9,   57.0,  0.01723,      0,      0,       0,       0,       0,       0
total,                                                387173,    6552,    6552,    6552,     7.6,     7.5,    12.0,    14.8,    26.3,    31.1,   57.0,  0.01723,      0,      0,       0,       0,       0,       0
READ,                                                 195968,    3416,    3416,    3416,     7.2,     7.0,    10.9,    13.1,    31.2,    37.6,   58.0,  0.01694,      0,      0,       0,       0,       0,       0
WRITE,                                                198023,    3402,    3402,    3402,     7.4,     7.4,    11.0,    13.3,    31.2,    33.0,   58.0,  0.01694,      0,      0,       0,       0,       0,       0
total,                                                393991,    6818,    6818,    6818,     7.3,     7.2,    10.9,    13.1,    31.2,    37.6,   58.0,  0.01694,      0,      0,       0,       0,       0,       0
READ,                                                 198736,    2768,    2768,    2768,     8.5,     7.9,    13.4,    28.1,    60.5,    66.2,   59.0,  0.01690,      0,      0,       0,       0,       0,       0
WRITE,                                                201011,    2988,    2988,    2988,     8.7,     8.1,    14.1,    33.1,    61.4,    64.7,   59.0,  0.01690,      0,      0,       0,       0,       0,       0
total,                                                399747,    5756,    5756,    5756,     8.6,     8.0,    13.7,    31.3,    61.2,    66.2,   59.0,  0.01690,      0,      0,       0,       0,       0,       0
READ,                                                 200538,    1802,    1802,    1802,    13.3,    11.4,    23.9,    61.3,   108.5,   134.9,   60.0,  0.01819,      0,      0,       0,       0,       0,       0
WRITE,                                                202789,    1778,    1778,    1778,    14.6,    12.0,    27.2,    72.9,   120.0,   136.7,   60.0,  0.01819,      0,      0,       0,       0,       0,       0
total,                                                403327,    3580,    3580,    3580,    14.0,    11.7,    26.0,    65.8,   120.0,   136.7,   60.0,  0.01819,      0,      0,       0,       0,       0,       0
READ,                                                 202006,    1587,    1587,    1587,    14.9,    12.2,    22.7,    99.6,   134.3,   144.0,   60.9,  0.01968,      0,      0,       0,       0,       0,       0
WRITE,                                                204244,    1573,    1573,    1573,    16.6,    13.9,    25.6,   110.2,   141.8,   142.5,   60.9,  0.01968,      0,      0,       0,       0,       0,       0
total,                                                406250,    3161,    3161,    3161,    15.7,    13.0,    24.4,   108.3,   134.3,   144.0,   60.9,  0.01968,      0,      0,       0,       0,       0,       0


Results:
Op rate                   :    6,668 op/s  [READ: 3,316 op/s, WRITE: 3,352 op/s]
Partition rate            :    6,668 pk/s  [READ: 3,316 pk/s, WRITE: 3,352 pk/s]
Row rate                  :    6,668 row/s [READ: 3,316 row/s, WRITE: 3,352 row/s]
Latency mean              :    7.4 ms [READ: 7.2 ms, WRITE: 7.5 ms]
Latency median            :    6.9 ms [READ: 6.7 ms, WRITE: 7.0 ms]
Latency 95th percentile   :   11.1 ms [READ: 11.0 ms, WRITE: 11.1 ms]
Latency 99th percentile   :   22.7 ms [READ: 22.0 ms, WRITE: 23.2 ms]
Latency 99.9th percentile :   70.1 ms [READ: 67.7 ms, WRITE: 72.8 ms]
Latency max               :  397.7 ms [READ: 397.7 ms, WRITE: 396.1 ms]
Total partitions          :    406,250 [READ: 202,006, WRITE: 204,244]
Total errors              :          0 [READ: 0, WRITE: 0]
Total GC count            : 0
Total GC memory           : 0.000 KiB
Total GC time             :    0.0 seconds
Avg GC time               :    NaN ms
StdDev GC time            :    0.0 ms
Total operation time      : 00:01:00

END